In [6]:
import sys  
sys.path.insert(0, '../ERData/PreProcessing/')

from er_preprocess import *

In [7]:
%cd ../../

/home/souvic/mounted/btp/vahini/Name2Demographics

In [1]:
import pandas as pd

f = pd.read_csv('er_shape.csv')

In [5]:
f['unique names'].sum()

7635322

In [32]:
def get_data(df, name):
    data = []
    data.append(name)
    data.append(df.shape[0])
    data.append(df.drop_duplicates().shape[0])
    mdf = df[df['Gender']=='MALE']
    fdf = df[df['Gender']=='FEMALE']
    data.append(mdf.shape[0])
    data.append(mdf.drop_duplicates().shape[0])
    data.append(fdf.shape[0])
    data.append(fdf.drop_duplicates().shape[0])
    return data

In [33]:
shapes = []
shapes.append(get_data(daman, "daman"))
shapes.append(get_data(manipur, "manipur"))
shapes.append(get_data(meghalaya, "meghalaya"))
shapes.append(get_data(nagaland, "nagaland"))
shapes.append(get_data(arunachal, "arunachal"))
shapes.append(get_data(delhi, "delhi"))
shapes.append(get_data(sikkim, "sikkim"))
shapes.append(get_data(goa, "goa"))
shapes.append(get_data(mizoram, "mizoram"))

In [40]:
df = pd.DataFrame(shapes, columns=['state','names','unique names','male','unique male','female', 'unique female'])

In [41]:
df.to_csv('Models/Data/er_shape.csv')

In [64]:
df = pd.read_csv('Models/Data/er_shape.csv')

In [65]:
total = df['unique names'].sum()
df['weight'] = df['unique names'] / total

In [66]:
df['count'] = 500*df['weight']

In [67]:
df['count'] = [round(count) for count in df['count']]

In [68]:
df

,Unnamed: 0,state,names,unique names,male,unique male,female,unique female,weight,count
0,0,daman,113136,108032,56381,53605,55712,53391,0.014149,7
1,1,manipur,1909440,1193419,919194,589948,966053,580415,0.156302,78
2,2,meghalaya,1922098,1506434,942317,737951,959827,748820,0.197298,99
3,3,nagaland,1177288,558415,583172,295039,583315,253274,0.073136,37
4,4,arunachal,777449,591152,380317,292544,390608,292158,0.077423,39
5,5,delhi,14039285,2458838,7634450,1430743,6305806,966324,0.322035,161
6,6,sikkim,398936,168490,200894,88209,193654,76145,0.022067,11
7,7,goa,1053415,744309,512134,361380,530032,372029,0.097482,49
8,8,mizoram,826015,306233,395634,158144,411910,134305,0.040107,20

In [9]:
daman = ERState_df_with_dup(DAMAN_CSV)

In [23]:
manipur = ERState_df_with_dup(MANIPUR_CSV)

In [24]:
meghalaya = ERState_df_with_dup(MEGHALAYA_CSV)

In [25]:
nagaland = ERState_df_with_dup(NAGALAND_CSV)

In [26]:
arunachal = ERState_df_with_dup(ARUNACHAL_CSV)

In [27]:
delhi = ERState_df_with_dup(DELHI_CSV)

In [28]:
sikkim = ERState_df_with_dup(SIKKIM_CSV)

In [29]:
goa = ERState_df_with_dup(GOA_CSV)

In [30]:
mizoram = ERState_df_with_dup(MIZORAM_CSV)

In [54]:
daman  = daman.drop_duplicates()
manipur = manipur.drop_duplicates()
meghalaya = meghalaya.drop_duplicates()
nagaland = nagaland.drop_duplicates()
arunachal = arunachal.drop_duplicates()
delhi = delhi.drop_duplicates()
sikkim = sikkim.drop_duplicates()
goa = goa.drop_duplicates()
mizoram = mizoram.drop_duplicates()

In [86]:
#  Remember 1 for male and 0 for female
def getnames(df):
    df_new = pd.DataFrame()
    df_new['Name'] = df['Name']
    df_new['Gender'] = df['new_labels']
    df_new['Gender'] = [ str(elem).replace("1.0","Male") for elem in df_new['Gender']]
    df_new['Gender'] = [ str(elem).replace("0.0","Female") for elem in df_new['Gender']]
    return df_new

In [87]:
daman  = ERStateData_with_freq(DAMAN_CSV)
daman = getnames(daman)

In [88]:
manipur  = ERStateData_with_freq(MANIPUR_CSV)
manipur = getnames(manipur)

In [89]:
delhi  = ERStateData_with_freq(DELHI_CSV)
delhi = getnames(delhi)

In [90]:
mizoram  = ERStateData_with_freq(MIZORAM_CSV)
mizoram = getnames(mizoram)

In [91]:
goa  = ERStateData_with_freq(GOA_CSV)
goa = getnames(goa)

In [92]:
sikkim  = ERStateData_with_freq(SIKKIM_CSV)
sikkim = getnames(sikkim)

In [93]:
arunachal  = ERStateData_with_freq(ARUNACHAL_CSV)
arunachal = getnames(arunachal)

In [94]:
nagaland  = ERStateData_with_freq(NAGALAND_CSV)
nagaland = getnames(nagaland)

In [95]:
meghalaya  = ERStateData_with_freq(MEGHALAYA_CSV)
meghalaya = getnames(meghalaya)

In [96]:
counts

[7, 78, 99, 37, 39, 161, 11, 49, 20]

In [56]:
counts = list(df['count'])

In [98]:
arr = [daman, manipur, meghalaya, nagaland, arunachal, delhi, sikkim, goa, mizoram]

In [102]:
final_df = pd.DataFrame()

for i, df in enumerate(arr):
    sample = df.sample(counts[i])
    final_df = final_df.append(sample, ignore_index=True)

In [104]:
%pwd

'/home/souvic/mounted/btp/vahini/Name2Demographics'

In [113]:
new_df.to_csv('/home/souvic/mounted/btp/ndata/samples/er_sample.csv')

In [103]:
final_df

                          Name  Gender
0      rajesh kantilal halpati    Male
1    dhodi dineshbhai babubhai    Male
2         damyanti pareshkumar  Female
3    solanki bharatiben bharat  Female
4         divyesh mahesh kamli    Male
..                         ...     ...
496           alaw dhar chakma    Male
497        hmangaihsangi royte  Female
498             rajkumar shahi    Male
499               k.lalrodinga    Male
500        rinhlupuii renthlei  Female

[501 rows x 2 columns]

In [71]:
#  Adding first names column

In [108]:
def split_name(name):
    name = str(name)
    # Trim begining spaces
    name = str(name).strip()
    firstname = str(name).split(' ')[0]
    lastname = ' '.join(str(name).split(" ")[1:])
    return firstname, lastname

def split_name_df(df, col):
    first_name = []
    last_name = []
    for name in df[col]:
        f,l = split_name(name)
        first_name.append(f)
        last_name.append(l)
        
    df['first_name'] = first_name
    df['last_name'] = last_name
    return df, first_name

In [110]:
new_df, _ = split_name_df(final_df, 'Name')

In [112]:
new_df.head()

                        Name  Gender first_name            last_name
0    rajesh kantilal halpati    Male     rajesh     kantilal halpati
1  dhodi dineshbhai babubhai    Male      dhodi  dineshbhai babubhai
2       damyanti pareshkumar  Female   damyanti          pareshkumar
3  solanki bharatiben bharat  Female    solanki    bharatiben bharat
4       divyesh mahesh kamli    Male    divyesh         mahesh kamli

In [69]:
#  CBSE Parent data
sys.path.insert(0, 'Models/CBSEData/CBSEPreProcessing/')

from parse_cbse import *

cbse = CBSEData()

# 1 for male 0 for female

In [70]:
# AIEEE Parent data